felixfelix-bot/balloon-fresh/mesh-stack/tollgate/sdkconfig.defaults
# --- Build target ---
CONFIG_IDF_TARGET="esp32c3"

# --- Flash / partition (ESP32-C3 module: 4 MB flash) ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# --- C++ runtime (nucula is C++) ---
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=0

# --- Enable exceptions + RTTI for std::optional/std::vector in nucula ---
# (std::optional is used in cashu.hpp; std::vector in wallet.hpp)

# --- Log level ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# --- FreeRTOS tick rate ---
CONFIG_FREERTOS_HZ=1000

# --- Disable features we don't need to keep the image small ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- mbedtls: nucula needs SHA-256, HMAC, base64, AES (TLS for mint HTTP) ---
CONFIG_MBEDTLS_HARDWARE_SHA=y

# --- WiFi stack (tollgate_core pulls it in as PRIV_REQUIRES) ---
CONFIG_ESP_WIFI_ENABLED=y

# --- Minimal console / system ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
